RIET/src/Catalogs/DistancesBetweenWarehouses/DistancesBetweenWarehouses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>DistancesBetweenWarehouses</name>
  <attributes>
    <name>SourceLocation</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>DestinationLocation</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>MileageNonMobilization</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MileageSummerMobilization</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MileageWinterMobilization</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MOT</name>
    <type>
      <types>CatalogRef.MOTs</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Catalogs/DistancesBetweenWarehouses/ManagerModule.bsl
Функция ПроверимМаршрут(Source, Destination, MOT) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	DistancesBetweenWarehouses.Ссылка
	|ИЗ
	|	Справочник.DistancesBetweenWarehouses КАК DistancesBetweenWarehouses
	|ГДЕ
	|	DistancesBetweenWarehouses.SourceLocation = &SourceLocation
	|	И DistancesBetweenWarehouses.DestinationLocation = &DestinationLocation
	|	И DistancesBetweenWarehouses.MOT = &MOT";
	Запрос.УстановитьПараметр("SourceLocation", Source);
	Запрос.УстановитьПараметр("DestinationLocation", Destination);
	Запрос.УстановитьПараметр("MOT", MOT);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции
